package Part_3;

import java.util.ArrayList;

public class Main
{
    public static void main(String[] args)
    {
        String[] predictions = new String[16];
        //позитивні
        predictions[0] = "Сьогодні вам пощастить і виграєте у лотореї";
        predictions[1] = "Наступного тижня у магазині буде знижка на ваші улюблені солодощі";
        predictions[2] = "Вас чекає успіх на роботі. якщо її немає, вам точно пощастиь її знайти";
        predictions[3] = "Цього місяця вас оминатимуть усі негаразди";
        //негативні
        predictions[4] = "Як б ви не старались, ви знайдете калюжу, яка точно промочить ваші шкарпетки";
        predictions[5] = "Нажаль, вам діагностували поганий настрій на цілий день";
        predictions[6] = "Ніякого світла після важкого робочого дня";
        predictions[7] = "У вашому магазині не буде ваших улюблених солодощів на цьому тижні";
        //нейтральні
        predictions[8] = "Блискавка вдарить у найвищу точку вашого міста";
        predictions[9] = "Скоро буде дощ у вашому місті, не забудьте парасольку";
        predictions[10] = "Сьогодні ви побачите на 5 цуциків більше, ніж котів";
        predictions[11] = "Завтра на вас чекає звичайний день";
        //креативні
        predictions[12] = "Ви отримаєте автомат – 5Б на заліку з ООП";
        predictions[13] = "Це точно креативне передбачення";
        predictions[14] = "При обчисленні кореня з 4 ви завжди отримаєте 2";
        predictions[15] = "Якщо ви скажете кактусові декілька приємних слів, він стане трішечки веселішим";

        System.out.println("Це ваш набір передбачень:");
        for (int i = 1; i <= 3; i ++)
        {
            int prediction = (int) (Math.random() * 12 + 1);
            System.out.println("Передбачення №" + i + ": " + predictions[prediction]);
        }
    }
}
